'''
문제
오늘도 서준이는 알고리즘의 수행시간 수업 조교를 하고 있다. 아빠가 수업한 내용을 학생들이 잘 이해했는지 문제를 통해서 확인해보자.

입력의 크기 n이 주어지면 MenOfPassion 알고리즘 수행 시간을 예제 출력과 같은 방식으로 출력해보자.

MenOfPassion 알고리즘은 다음과 같다.

MenOfPassion(A[], n) {
    sum <- 0;
    for i <- 1 to n
        sum <- sum + A[i]; # 코드1
    return sum;
}
입력
첫째 줄에 입력의 크기 n(1 ≤ n ≤ 500,000)이 주어진다.

출력
첫째 줄에 코드1 의 수행 횟수를 출력한다.

둘째 줄에 코드1의 수행 횟수를 다항식으로 나타내었을 때, 최고차항의 차수를 출력한다.
단, 다항식으로 나타낼 수 없거나 최고차항의 차수가 3보다 크면 4를 출력한다.

예제 입력 1 
7
예제 출력 1 
7
1
코드1 이 7회 수행되고 알고리즘의 수행 시간이 n에 비례한다.
'''

# 이번 MenOfPassion 은 n이 1이면 한번, 10이면 10번 반복된다.
# 시간 복잡도는 O(n).

# 의사코드는 sum = 0 에 n을 1~n까지 하나씩 반복해 더한다.

size = int(input())

count = size # 저 코드는 size만큼 반복된다.

degree = 1 # 시간복잡도가 O(n)이다. n의 지수는 1이다.

print(count)
print(degree)
