'''
문제
정수 4를 1, 2, 3의 합으로 나타내는 방법은 총 7가지가 있다.
합을 나타낼 때는 수를 1개 이상 사용해야 한다.

1+1+1+1
1+1+2
1+2+1
2+1+1
2+2
1+3
3+1
정수 n이 주어졌을 때, n을 1, 2, 3의 합으로 나타내는 방법의 수를 구하는 프로그램을 작성하시오.

입력
첫째 줄에 테스트 케이스의 개수 T가 주어진다.
각 테스트 케이스는 한 줄로 이루어져 있고, 정수 n이 주어진다.
n은 양수이며 1,000,000보다 작거나 같다.

출력
각 테스트 케이스마다, n을 1, 2, 3의 합으로 나타내는 방법의 수를 1_000_000_009로 나눈 나머지를 출력한다.

예제 입력 1 
3
4
7
10
예제 출력 1 
7
44
274
'''

# 이제 뭐.. 이정도야
# 1로끝날때 2로끝날때 3으로끝날때 다 더해주면되는거지뭐

import sys
input = sys.stdin.readline

dp = [0, 1, 2, 4] + [0] * (1_000_000 - 3)
MOD = 1_000_000_009

for i in range(4, 1_000_000 + 1):
    dp[i] = (dp[i - 1] + dp[i - 2] + dp[i - 3]) % MOD
    # 1 + dp[i-1], 2 + dp[i-2], 3 + dp[i-3]

T = int(input())
for _ in range(T):
    N = int(input())
    print(dp[N])
