'''
입력
입력은 총 5줄로 이루어져 있고, 원섭이의 점수, 세희의 점수, 상근이의 점수, 숭이의 점수, 강수의 점수가 순서대로 주어진다.

점수는 모두 0점 이상, 100점 이하인 5의 배수이다. 따라서, 평균 점수는 항상 정수이다. 

출력
첫째 줄에 학생 5명의 평균 점수를 출력한다.

예제 입력 1 
10
65
100
30
95
예제 출력 1 
68
힌트
숭과 원섭이는 40점 미만이고, 보충학습에 참여할 예정이기 때문에 40점을 받게 된다. 따라서, 점수의 합은 340점이고, 평균은 68점이 된다.
'''

a = max(int(input()), 40)
b = max(int(input()), 40)
c = max(int(input()), 40)
d = max(int(input()), 40)
e = max(int(input()), 40)
print(sum([a, b, c, d, e]) // 5) # sum 안에는 리스트나 튜플을 넣어주자.

nums = [max(int(input()), 40) for _ in range(5)]
print(sum(nums) // 5)
