'''
문제
상근이는 친구들과 함께 SF영화를 찍으려고 한다. 이 영화는 외계 지형이 필요하다.
실제로 우주선을 타고 외계 행성에 가서 촬영을 할 수 없기 때문에, 컴퓨터 그래픽으로 CG처리를 하려고 한다.

외계 지형은 중앙 이동 알고리즘을 이용해서 만들려고 한다.

알고리즘을 시작하면서 상근이는 정사각형을 이루는 점 4개를 고른다. 그 후에는 다음과 같은 과정을 거쳐서 지형을 만든다.

정사각형의 각 변의 중앙에 점을 하나 추가한다.
정사각형의 중심에 점을 하나 추가한다.
초기 상태에서 위와 같은 과정을 한 번 거치면 총 4개의 정사각형이 새로 생긴다. 이와 같은 과정을 상근이가 만족할 때 까지 계속한다.

아래 그림은 과정을 총 2번 거쳤을 때까지의 모습이다.
		
초기 상태 - 점 4개	1번 - 점 9개	2번 - 25개
상근이는 어떤 점은 한 개 보다 많은 정사각형에 포함될 수 있다는 사실을 알았다.
메모리 소모량을 줄이기 위해서 중복하는 점을 한 번만 저장하려고 한다.
과정을 N번 거친 후 점 몇 개를 저장해야 하는지 구하는 프로그램을 작성하시오.

입력
첫째 줄에 N이 주어진다. (1 ≤ N ≤ 15)

출력
첫째 줄에 과정을 N번 거친 후 점의 수를 출력한다.

예제 입력 1 
1
예제 출력 1 
9
예제 입력 2 
2
예제 출력 2 
25
예제 입력 3 
5
예제 출력 3 
1089
'''
'''
# 일단 아이디어는.. ㄴ자모양으로 점 세개씩 묶고
# 끝 변에 나머지 점을 더해주는 방식
# ㄴ자의 개수는 2의 i제곱의 제곱으로 커진다.
# 나머지 점은 한 변에 2의 i제곱만큼 있다. 변은 두 개 남는다.
cnt = int(input())

answer = 4
for i in range(cnt):
    answer += 3 * (2 ** i) ** 2 + 2 * (2 ** i)
print(answer)
'''
# 좀 치네

print((2 ** int(input()) + 1) ** 2)
# ㅆㅃㅆㅃ
# 그냥 i번째에사 점의 개수는 2의 i제곱에 1을 더한 것의 제곱이다.
# 나눠진 칸의 정사각형 개수를 세어 봐라...
# 0번째는 1이고, 2*2, 4*4, 8*8... 이런식이다.
# 그러면 점의 개수는? 변에 1씩 더해서 제곱하면 된다는 거...