'''
문제
알파벳 소문자로만 이루어진 단어 S가 주어진다.
각각의 알파벳에 대해서, 단어에 포함되어 있는 경우에는 처음 등장하는 위치를, 포함되어 있지 않은 경우에는 -1을 출력하는 프로그램을 작성하시오.

입력
첫째 줄에 단어 S가 주어진다. 단어의 길이는 100을 넘지 않으며, 알파벳 소문자로만 이루어져 있다.

출력
각각의 알파벳에 대해서, a가 처음 등장하는 위치, b가 처음 등장하는 위치, ... z가 처음 등장하는 위치를 공백으로 구분해서 출력한다.

만약, 어떤 알파벳이 단어에 포함되어 있지 않다면 -1을 출력한다. 단어의 첫 번째 글자는 0번째 위치이고, 두 번째 글자는 1번째 위치이다.

예제 입력 1 
baekjoon
예제 출력 1 
1 0 -1 -1 2 -1 -1 -1 -1 4 3 -1 -1 7 5 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 -1
'''

# word = input()
# alpha_list = [-1] * 26

# for abc in word:
#     for alphabet in "abcdefghijklmnopqrstuvwxyz":
#         if abc == alphabet:
#             alpha_list[ord(abc) - 97] = word.index(abc) # 리스트랑 똑같이 .index로 위치를 찾는다

# print(*alpha_list)
# 너무 어렵게 풀었다는 느낌.

word = input()
for i in range(97, 123):
    print(word.find(chr(i)), end = " ")
    
# .find는 문자열에서만 사용 가능하다.
# .find는 있는 글자면 인덱스를 반환하고 없으면 -1을 반환한다.
# 이걸 몰랐으니 저딴 어려운 코드가 나오지.